In [49]:
# Initialize Otter
import otter
grader = otter.Notebook("MergeTables.ipynb")

In [50]:
import pandas as pd
import numpy as np

# <span style="color:red">Merging Tables</span>

When making data-driven decisions, we often need information from various sources. For example, to identify at-risk students on campus, we'd analyze data from platforms like Brightspace, course registration, dining, AARC, and personal records. The Pandas library offers several methods to compare and merge these different dataframes, aiding in the analysis.

### Concatenate two dataframes together (vertically)

Pandas `concat` method simply concatenates two dataframes together.

In [3]:
df1 = pd.DataFrame({'Name': ['Kevin', 'Tyler', 'Kyla', 'Josh'],
                   'Age': [22, 35, 21, 50]},
                  index=[0, 1, 2, 3])
df1

    Name  Age
0  Kevin   22
1  Tyler   35
2   Kyla   21
3   Josh   50

In [4]:
df2 = pd.DataFrame({'Name': ['Justin', 'Jacob', 'Ben', 'Hector'],
                   'Age': [20, 15, 44, 9]}, 
                  index = [4, 5, 6, 7])
df2

     Name  Age
4  Justin   20
5   Jacob   15
6     Ben   44
7  Hector    9

In [5]:
df3 = pd.concat([df1, df2]) # Try to run the code by removing the index parameter from the df1 and df2; and see the difference
df3

     Name  Age
0   Kevin   22
1   Tyler   35
2    Kyla   21
3    Josh   50
4  Justin   20
5   Jacob   15
6     Ben   44
7  Hector    9

### Concatenate two dataframes together (horizontally)

In [6]:
df4 = pd.DataFrame({'Name': ['Cynthia', 'Benn', 'Emily', 'Hector'],
                   'City': ['Houston', 'Dallas', 'New York', 'Seattle']}, 
                  index = [8, 6, 9, 7])
df4

      Name      City
8  Cynthia   Houston
6     Benn    Dallas
9    Emily  New York
7   Hector   Seattle

In [7]:
pd.concat([df3, df4], axis='columns')

     Name   Age     Name      City
0   Kevin  22.0      NaN       NaN
1   Tyler  35.0      NaN       NaN
2    Kyla  21.0      NaN       NaN
3    Josh  50.0      NaN       NaN
4  Justin  20.0      NaN       NaN
5   Jacob  15.0      NaN       NaN
6     Ben  44.0     Benn    Dallas
7  Hector   9.0   Hector   Seattle
8     NaN   NaN  Cynthia   Houston
9     NaN   NaN    Emily  New York

In [8]:
pd.concat([df3, df4], axis='columns', join='inner')

     Name  Age    Name     City
6     Ben   44    Benn   Dallas
7  Hector    9  Hector  Seattle

In [9]:
df1 = pd.DataFrame({'Name': ['Kevin', 'Cynthia', 'Hector', 'Justin'],
                       'Dept': ['CS', 'Math', 'Math', 'Business']})

df1

      Name      Dept
0    Kevin        CS
1  Cynthia      Math
2   Hector      Math
3   Justin  Business

In [10]:
df2 = pd.DataFrame({'Gpa': [2.9, 3.3, 3.9, 2.2],
                       'City': ['Houston', 'Dallas', 'Seattle', 'Austin']})

df2

   Gpa     City
0  2.9  Houston
1  3.3   Dallas
2  3.9  Seattle
3  2.2   Austin

In [11]:
pd.concat([df1, df2], axis='columns')

      Name      Dept  Gpa     City
0    Kevin        CS  2.9  Houston
1  Cynthia      Math  3.3   Dallas
2   Hector      Math  3.9  Seattle
3   Justin  Business  2.2   Austin

### Merging tables

#### Performing cartesian product of rows of two tables

A cartesian product joins each row of left table with every rows of right table. The resulant table will have n1 * n2 rows, where n1 and n2 are the number of rows in left and right table respectively.

In [12]:
left = pd.DataFrame({'SID': [111, 222, 111, 333],
                    'Name': ['Kelly', 'John', 'Kelly', 'Megan'],
                    'Course': ['CSCI1302', 'MTH1304', 'CSCI1462', 'CSCI1462']})

right = pd.DataFrame({'EID': ['XY03', 'ZZ02', 'FF02', 'YYY2'],
                    'Name': ['Kelly', 'Ben', 'John', 'Max'],
                    'Designation': ['Manager', 'CEO', 'HRManager', 'Developer']})

In [13]:
left

   SID   Name    Course
0  111  Kelly  CSCI1302
1  222   John   MTH1304
2  111  Kelly  CSCI1462
3  333  Megan  CSCI1462

In [14]:
right

    EID   Name Designation
0  XY03  Kelly     Manager
1  ZZ02    Ben         CEO
2  FF02   John   HRManager
3  YYY2    Max   Developer

In [15]:
pd.merge(left, right, how='cross') # Cartesian Product

    SID Name_x    Course   EID Name_y Designation
0   111  Kelly  CSCI1302  XY03  Kelly     Manager
1   111  Kelly  CSCI1302  ZZ02    Ben         CEO
2   111  Kelly  CSCI1302  FF02   John   HRManager
3   111  Kelly  CSCI1302  YYY2    Max   Developer
4   222   John   MTH1304  XY03  Kelly     Manager
5   222   John   MTH1304  ZZ02    Ben         CEO
6   222   John   MTH1304  FF02   John   HRManager
7   222   John   MTH1304  YYY2    Max   Developer
8   111  Kelly  CSCI1462  XY03  Kelly     Manager
9   111  Kelly  CSCI1462  ZZ02    Ben         CEO
10  111  Kelly  CSCI1462  FF02   John   HRManager
11  111  Kelly  CSCI1462  YYY2    Max   Developer
12  333  Megan  CSCI1462  XY03  Kelly     Manager
13  333  Megan  CSCI1462  ZZ02    Ben         CEO
14  333  Megan  CSCI1462  FF02   John   HRManager
15  333  Megan  CSCI1462  YYY2    Max   Developer

<img src="https://www.ionos.fr/digitalguide/fileadmin/DigitalGuide/Screenshots_2019/sql-outer-join.png" width=500 />

### Performing inner join between rows of tables

Inner join select rows from both the tables that have matching keys in both the tables.

In [16]:
left

   SID   Name    Course
0  111  Kelly  CSCI1302
1  222   John   MTH1304
2  111  Kelly  CSCI1462
3  333  Megan  CSCI1462

In [17]:
right

    EID   Name Designation
0  XY03  Kelly     Manager
1  ZZ02    Ben         CEO
2  FF02   John   HRManager
3  YYY2    Max   Developer

In [18]:
pd.merge(left, right, how='inner', on='Name')

   SID   Name    Course   EID Designation
0  111  Kelly  CSCI1302  XY03     Manager
1  222   John   MTH1304  FF02   HRManager
2  111  Kelly  CSCI1462  XY03     Manager

### Performing outer join between rows of tables

The outer join returns all the rows from both the tables when there is a match between the keys (like inner join). Moreover,  if there are rows in one table that do not have matches in the other, those rows will also be listed, with missing(NaN) values in the columns from the table without a match.

In [19]:
left

   SID   Name    Course
0  111  Kelly  CSCI1302
1  222   John   MTH1304
2  111  Kelly  CSCI1462
3  333  Megan  CSCI1462

In [20]:
right

    EID   Name Designation
0  XY03  Kelly     Manager
1  ZZ02    Ben         CEO
2  FF02   John   HRManager
3  YYY2    Max   Developer

In [21]:
pd.merge(left, right, how='outer', on='Name')

     SID   Name    Course   EID Designation
0    NaN    Ben       NaN  ZZ02         CEO
1  222.0   John   MTH1304  FF02   HRManager
2  111.0  Kelly  CSCI1302  XY03     Manager
3  111.0  Kelly  CSCI1462  XY03     Manager
4    NaN    Max       NaN  YYY2   Developer
5  333.0  Megan  CSCI1462   NaN         NaN

### Performing left join between rows of tables

The left join returns all the rows from the left table and the matching rows from the right table. Moreover,  if there are rows in left table that do not have matches in the right, those rows will also be listed, with missing(NaN) values in the columns from the right table without a match.

In [22]:
left

   SID   Name    Course
0  111  Kelly  CSCI1302
1  222   John   MTH1304
2  111  Kelly  CSCI1462
3  333  Megan  CSCI1462

In [23]:
right

    EID   Name Designation
0  XY03  Kelly     Manager
1  ZZ02    Ben         CEO
2  FF02   John   HRManager
3  YYY2    Max   Developer

In [24]:
pd.merge(left, right, how='left', on='Name')

   SID   Name    Course   EID Designation
0  111  Kelly  CSCI1302  XY03     Manager
1  222   John   MTH1304  FF02   HRManager
2  111  Kelly  CSCI1462  XY03     Manager
3  333  Megan  CSCI1462   NaN         NaN

### Performing right join between rows of tables

The right join returns all the rows from the right table and the matching rows from the left table. Moreover,  if there are rows in right table that do not have matches in the left, those rows will also be listed, with missing(NaN) values in the columns from the left table without a match.

In [25]:
left

   SID   Name    Course
0  111  Kelly  CSCI1302
1  222   John   MTH1304
2  111  Kelly  CSCI1462
3  333  Megan  CSCI1462

In [26]:
right

    EID   Name Designation
0  XY03  Kelly     Manager
1  ZZ02    Ben         CEO
2  FF02   John   HRManager
3  YYY2    Max   Developer

In [27]:
pd.merge(left, right, how='right', on='Name')

     SID   Name    Course   EID Designation
0  111.0  Kelly  CSCI1302  XY03     Manager
1  111.0  Kelly  CSCI1462  XY03     Manager
2    NaN    Ben       NaN  ZZ02         CEO
3  222.0   John   MTH1304  FF02   HRManager
4    NaN    Max       NaN  YYY2   Developer

In [28]:
left = pd.DataFrame({'Id': [100, 200, 300],
                    'FirstName': ['Mary', 'Vincent', 'Jack'],
                    'LastName': ['Dufrene', 'Robin', 'Sparrow']})

right = pd.DataFrame({'FirstName': ['Jack', 'Mary', 'Vincent', 'Jack'],
                      'LastName' : ['Sullivan', 'Dufrene', 'Morgan', 'Sparrow'],
                      'City': ['Nacogdoches', 'Houston', 'Dallas', 'Houston']})

In [29]:
left

    Id FirstName LastName
0  100      Mary  Dufrene
1  200   Vincent    Robin
2  300      Jack  Sparrow

In [30]:
right

  FirstName  LastName         City
0      Jack  Sullivan  Nacogdoches
1      Mary   Dufrene      Houston
2   Vincent    Morgan       Dallas
3      Jack   Sparrow      Houston

In [ ]:
pd.merge(left, right, how='inner', on='FirstName')

### Question 1

A table named `mealSwipes` contains a row for each time a student swipe meals during the month of Oct, Nov and Dec. The table contains four columns: 
- Email: a string, the email address of the student
- Department: a string, the department that the student belongs to
- Meal Swipes: an int, the number of meal swipes per month
- Month: a string, the month in which the student swiped for the meals

A second table `roster` contains a row for each student enrolled at SFA. It has two columns: 
- Email: a string, the email address of the student
- Name: a string, the first name of the student

Note: Every student has one unique email address, but two students might have the same name. 

Write python code to answer the following questions:

In [31]:
mealSwipes = pd.read_csv('data/mealSwipes.csv')
mealSwipes.head(3)

                 Email   Department  MealSwipes Month
0  erica7298@sfasu.edu      Physics         472   Oct
1      dacey@sfasu.edu  Mathematics          33   Nov
2  slade7982@sfasu.edu      Physics         178   Oct

In [32]:
roster = pd.read_csv('data/roster.csv')
roster.head(3)

                 Email   Name
0  erica7298@sfasu.edu  Erica
1      dacey@sfasu.edu  Dacey
2  slade7982@sfasu.edu  Slade

### Question 1(a) 
The largest number of meal swipes made by any student. Store your result in `your_ans`. 

Hint: Use numpy `max` method

In [33]:
your_ans = np.max(mealSwipes['MealSwipes'])
your_ans

np.int64(499)

In [34]:
grader.check("q1(a)")

q1(a) results: All test cases passed!

### Question 1(b)

The department that appears most often in the `mealSwipes` table. Store your result in the variable `your_ans`.

In [44]:
df = mealSwipes[['MealSwipes', 'Department']].groupby('Department', as_index = False).count()
sorted_df = df.sort_values('MealSwipes', ascending=False)
your_ans = sorted_df.iloc[0, 0]
your_ans

'EarthSci'

In [45]:
grader.check("q1(b)")

q1(b) results: All test cases passed!

### Question 1(c)

The total number of meal swipes for the month of November for students belonging to the department of `CompSci`, `Chemistry` and `Mathematics`.

In [ ]:
your_ans = ...
your_ans

In [ ]:
grader.check("q1(c)")

### Question 1(d)

The name of the student who had most meal swipes across all three months. (Assume no ties; i.e, no two students have the most swipes)

In [ ]:
your_ans = ...
your_ans

In [ ]:
grader.check("q1(d)")